---
kind: method
id: M:Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/dec8a5ac-1221-0de5-9115-eea798ce4dac.htm
---
# Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.